#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_iam_user.bia: Refreshing state... [id=BeatrizTantow]
aws_iam_user.petrolifero: Refreshing state... [id=petrolifero]
module.authentication.aws_iam_user.HR: Refreshing state... [id=HR]
module.authentication.aws_vpc.ldap: Refreshing state... [id=vpc-04c22c5ff09fcce8f]
aws_s3_bucket.state: Refreshing state... [id=terraform-state-infra-repository]
module.CI.aws_vpc.jenkins: Refreshing state... [id=vpc-0be5058901912101c]
aws_dynamodb_table.lockState: Refreshing state... [id=terraform-state-locking]
aws_iam_user.canellas: Refreshing state... [id=EduardoCanellas]
module.authentication.aws_subnet.ldap2: Refreshing state... [id=subnet-0a8940f06429d81fb]
module.authentication.aws_subnet.ldap1: Refreshing state... [id=subnet-0d01be6588beb0b03]
module.CI.aws_subnet.buildersJenkins: Refreshing state... [id=subnet-0b33858a960e468c1]
module.CI.aws_subnet.guiJenkins: Refreshing state... [id=subnet-0017b957ed2860d95]
module.authentication.aws_directory_service_directory.ldap: Refreshing state... [id=d-94673df656]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.authentication.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "bbbfake.com"
      + domain_validation_options = [
          + {
              + domain_name           = "bbbfake.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "terraform" = "yes"
        }
      + tags_all                  = {
          + "terraform" = "yes"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.authentication.aws_instance.microsoftPKIRoot will be created
  + resource "aws_instance" "microsoftPKIRoot" {
      + ami                                  = "ami-03ea5c5403c5bcc24"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = true
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "MicrosoftPKIKeyPair"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "terraform" = "yes"
        }
      + tags_all                             = {
          + "terraform" = "yes"
        }
      + tenancy                              = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.authentication.aws_internet_gateway.accessToVpnLDAP will be created
  + resource "aws_internet_gateway" "accessToVpnLDAP" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name" = "main"
        }
      + vpc_id   = "vpc-04c22c5ff09fcce8f"
    }

  # module.authentication.aws_key_pair.PKIKeyPair will be created
  + resource "aws_key_pair" "PKIKeyPair" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "MicrosoftPKIKeyPair"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCW2Ag0ts+mwcni0K/HoGSj7dnNRoynDWMD+Lq6rT6XQCPK4LrFZXI02GzCkSTd/h3PWSLvk8EjSVIH3P8jy5ucdq12p8Nqf9z5l3y+26F91FUYd1X2ZAageEBqEnnpGR+EEqd3Rff8/aer62Hg310hsxRsKzctXTKoAsE8qcIBCrJ9QE21Rg+LuSNn/3i/7HkUNqvhslAzCd73aO5mR4pYRY0oBzTuzAW1j3w1rfvmtenBr9AyvVSWTdfHJvmKVHJ6SaDYQBr2q7TLmo//T/jkAUU9UzDwoS3upzHGeM85cCH6AIFtDnsyUiejYVqMaCZM4Hcvkj9jCASBkhgwfECn"
      + tags        = {
          + "terraform" = "no"
        }
      + tags_all    = {
          + "terraform" = "no"
        }
    }

  # module.authentication.aws_subnet.PKIRoot will be created
  + resource "aws_subnet" "PKIRoot" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = "vpc-04c22c5ff09fcce8f"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @petrolifero, Action: `pull_request`*